var menuList = [{
    titles: ['家用电器'],
    content: {
        tabs: ['家电馆', '家电618', '家电服务','家电专卖店','企业采购','商用电器','以旧换新'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
}, {
    titles: ['手机', '运营商', '数码'],
    content: {
        tabs: ['手机'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
}, {
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
}, 
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
        {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        },{
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        },{
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},{

    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},
{
    titles: ['电脑', '办公'],
    content: {
        tabs: ['家电馆', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
},

    {
    titles: ['家居', '家具', '家装', '厨具'],
    content: {
        tabs: ['家居', '镇乡专卖店', '家电服务'],
        subs: [{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },{
            title: '电视',
            items: ["超薄电视", "全面屏电视", "智能电视", "教育电视", "OLED电视", "智慧屏", "4K超清电视", "55英寸", "65英寸", "电视配件"]
        },        
         {
            title: '空调',
            items: ["壁挂式空调", "柜式空调", "中央空调", "一级能效空调", "变频空调", "1.5匹空调", "以旧换新","以旧换新"]
        }]
    }
    }];

 
function renderMenuList (data) {
    var str = '';
    for(var i = 0; i <data.length; i ++){
        var titles  = data[i].titles;
        console.log('success in for ')
        str+=`<li >
        ${titles.map(function(title){
            return `<a href="#">${title}</a>`
        }).join('  <span>/</span>  ')}
    </li> `
    }
    $('.fs-menu').html(str);
}
renderMenuList(menuList)
// var timer = null;
$('.fs-menu').on('mouseenter' , 'li' ,function () {
    // 鼠标移入，背景切换
    $('.menu-item-on').removeClass('menu-item-on')
    $(this).addClass('menu-item-on')
    // 获取当前鼠标移入的菜单索引值
    var index = $(this).index();
    renderMenuContent(menuList[index].content);
    $('.menu-content').show();
})

$('.fs-1').mouseleave(function() {
    $('.menu-content').hide()
    $('.menu-item-on').removeClass('menu-item-on')
})

// 渲染右侧内容区  此时的data就是右侧内容区的数据，也就是menulist下面的content
function renderMenuContent(data){
    var tabsNav = $('<div class="tabs-nav"></div>');
    var cateDetails = $('<div class="cate-details"></div>');

    data.tabs.forEach(function (tab) {
        $(`<a href="#">家电馆
        <span class="iconfont">&#xe612;</span>
    </a>`).appendTo(tabsNav)
    });
    data.subs.forEach(function (sub) {
        var oDl = $('<dl class="cate-item"></dl>');

        $(`<dt><a href="#">${sub.title}</a>
        <span class="iconfont">&#xe612;</span></dt>`)
        .appendTo(oDl);
        var oDd = $('<dd></dd>')
        sub.items.forEach(function (item) {
            $(`<a href="#">${item}</a>`).appendTo(oDd)
        })
        oDl.append(oDd).appendTo(cateDetails);
    })


    $('.menu-content').empty().append(tabsNav).append(cateDetails);
}